	<title>Леоненко Ф.И. ЭАС-410</title>
<h3>

<?php 
	

	$a = rand(-20,20);

	$b = rand(-20,20);

	$c = rand(-20,20);

	$d = rand(-20,20);

	$x=((2* $c)+(51* $d))/($d-$a -1);

	echo 'Вычисляемое выражение №1: ' . '((2*' . $c . ')+(51*' . $d . '))/(' . $d . '-' . $a . '-1)' . ' = ';

	echo $x . '<br>';

	echo '<br>';

	$y=(($b*(2*$c)+$d)-52)/(($a/3)-1);

	echo 'Вычисляемое выражение №2:' . '(('. $b . '*(2*' . $c . ')+' . $d . ')-52)/((' . $a . '/3)-1)' . ' = ';

	echo $y;

 ?>
 	</h3>